УТ_для_edt/src/InformationRegisters/CRM_ОтложенныеОперацииПоIMAP/CRM_ОтложенныеОперацииПоIMAP.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ОтложенныеОперацииПоIMAP</name>
  <attributes>
    <name>ИмяПапкиНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ПапкиЭлектронныхПисем</types>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Действие</name>
    <type>
      <types>EnumRef.CRM_ДействияПоIMAP</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/ПредметыПапкиВзаимодействий/ПредметыПапкиВзаимодействий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПредметыПапкиВзаимодействий</name>
  <resources>
    <name>Предмет</name>
    <type>
      <types>DefinedType.ПредметВзаимодействия</types>
    </type>
  </resources>
  <resources>
    <name>ПапкаЭлектронногоПисьма</name>
    <type>
      <types>CatalogRef.ПапкиЭлектронныхПисем</types>
    </type>
  </resources>
  <resources>
    <name>Рассмотрено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РассмотретьПосле</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Взаимодействие</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЗапланированноеВзаимодействие</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.Встреча</types>
      <types>DocumentRef.СообщениеSMS</types>
      <types>DocumentRef.УдалитьCRM_Событие</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_НепрочитанныеЭлектронныеПисьма/CRM_НепрочитанныеЭлектронныеПисьма.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_НепрочитанныеЭлектронныеПисьма</name>
  <dimensions>
    <name>УдалитьУчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПапка</name>
    <type>
      <types>CatalogRef.ПапкиЭлектронныхПисем</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Письмо</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/CRM_ДействияПоIMAP/CRM_ДействияПоIMAP.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ДействияПоIMAP</name>
  <enumValues>
    <name>ПереместитьВсеПисьмаВПапку</name>
  </enumValues>
  <enumValues>
    <name>ПереместитьПисьмоВПапку</name>
  </enumValues>
  <enumValues>
    <name>СнятьФлагПрочтения</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПапку</name>
  </enumValues>
  <enumValues>
    <name>УстановитьФлагПрочтения</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/CRM_ВидыПапокЭлектроннойПочты/CRM_ВидыПапокЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВидыПапокЭлектроннойПочты</name>
  <enumValues>
    <name>Входящие</name>
  </enumValues>
  <enumValues>
    <name>Исходящие</name>
  </enumValues>
  <enumValues>
    <name>Отправленные</name>
  </enumValues>
  <enumValues>
    <name>Черновики</name>
  </enumValues>
  <enumValues>
    <name>Удаленные</name>
  </enumValues>
  <enumValues>
    <name>Обработанные</name>
  </enumValues>
  <enumValues>
    <name>НежелательнаяПочта</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/ЭлектронноеПисьмоВходящее/ЭлектронноеПисьмоВходящее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭлектронноеПисьмоВходящее</name>
  <posting>Deny</posting>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийЗаголовок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторыОснований</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительКонтакт</name>
    <type>
      <types>DefinedType.КонтактВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейКопий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТекста</name>
    <type>
      <types>EnumRef.ТипыТекстовЭлектронныхПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВзаимодействиеОснование</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОДоставке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОПрочтении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СкрытьИзСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СкрытьВАРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СмещениеДатыОтправления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СмещениеДатыОтправленияЗаполнено</name>
    <comment>Для корректности расчета дат документов, введенных до нового функционала расчета</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Избранный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиПисьма</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиКопий</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиОтвета</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АдресаУведомленияОПрочтении</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НепринятыеВложения</name>
    <attributes>
      <name>ИмяВложение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.CRM_Теги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/CommonModules/CRM_УправлениеЭлектроннойПочтойIMAP/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Управление электронной почтой (CRM)
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ЭкспортныеПроцедурыИФункции

// Выполняет отложенные операции по IMAP.
//
// Параметры:
//	ДанныеУчетнойЗаписи - Структура - данные учетной записи.
//	Почта - ИнтернетПочта - почта.
//	МассивИменАктивныхПапок - Массив - массив имен активных папок.
//
Процедура ВыполнитьОтложенныеОперацииПоIMAP(ДанныеУчетнойЗаписи, Почта, МассивИменАктивныхПапок) Экспорт
	
	Попытка
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	CRM_ОтложенныеОперацииПоIMAP.Объект КАК Объект,
		|	CRM_ОтложенныеОперацииПоIMAP.ИмяПапкиНаСервере КАК ИмяПапкиНаСервере,
		|	CRM_ОтложенныеОперацииПоIMAP.Действие КАК Действие,
		|	ВЫБОР
		|		КОГДА ПредметыПапкиВзаимодействий.ПапкаЭлектронногоПисьма.CRM_ИмяНаСервере = """"
		|			ТОГДА ПредметыПапкиВзаимодействий.ПапкаЭлектронногоПисьма.Наименование
		|		ИНАЧЕ ПредметыПапкиВзаимодействий.ПапкаЭлектронногоПисьма.CRM_ИмяНаСервере
		|	КОНЕЦ КАК ТекущаяПапка,
		|	CRM_ОтложенныеОперацииПоIMAP.Объект.Дата КАК ДатаМин,
		|	CRM_ОтложенныеОперацииПоIMAP.Объект.Дата КАК ДатаМакс
		|ИЗ
		|	РегистрСведений.CRM_ОтложенныеОперацииПоIMAP КАК CRM_ОтложенныеОперацииПоIMAP
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредметыПапкиВзаимодействий КАК ПредметыПапкиВзаимодействий
		|		ПО CRM_ОтложенныеОперацииПоIMAP.Объект = ПредметыПапкиВзаимодействий.Взаимодействие
		|ГДЕ
		|	CRM_ОтложенныеОперацииПоIMAP.УчетнаяЗапись = &УчетнаяЗапись
		|ИТОГИ
		|	МИНИМУМ(ДатаМин),
		|	МАКСИМУМ(ДатаМакс)
		|ПО
		|	Действие,
		|	ИмяПапкиНаСервере,
		|	ТекущаяПапка");
		Запрос.УстановитьПараметр("УчетнаяЗапись", ДанныеУчетнойЗаписи.Ссылка);
		ВыборкаДействий = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ВыборкаДействий.НайтиСледующий(Новый Структура("Действие", Перечисления.CRM_ДействияПоIMAP.ПереместитьВсеПисьмаВПапку));
		ВыборкаПапок = ВыборкаДействий.Выбрать();
		Пока ВыборкаПапок.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаПапок.Объект) Тогда
				ПереместитьВсеПисьмаВПапкуНаСервере(Почта, ВыборкаПапок.Объект);
				УдаляемЗапись = РегистрыСведений.CRM_ОтложенныеОперацииПоIMAP.СоздатьМенеджерЗаписи();
				УдаляемЗапись.Объект = ВыборкаПапок.Объект;
				УдаляемЗапись.Действие = Перечисления.CRM_ДействияПоIMAP.ПереместитьВсеПисьмаВПапку;
				УдаляемЗапись.УчетнаяЗапись = ДанныеУчетнойЗаписи.Ссылка;
				УдаляемЗапись.Удалить();
			КонецЕсли;
		КонецЦикла;
		
		ВыборкаДействий.Сбросить();
		ВыборкаДействий.НайтиСледующий(Новый Структура("Действие", Перечисления.CRM_ДействияПоIMAP.ПереместитьПисьмоВПапку));
		ВыборкаПапок = ВыборкаДействий.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПапок.Следующий() Цикл
			Если МассивИменАктивныхПапок.Найти(ВыборкаПапок.ИмяПапкиНаСервере) = Неопределено Тогда Продолжить; КонецЕсли;
			Почта.ТекущийПочтовыйЯщик = ВыборкаПапок.ИмяПапкиНаСервере;
			ВыборкаПапокКуда = ВыборкаПапок.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПапокКуда.Следующий() Цикл
				ВыборкаОбъектов = ВыборкаПапокКуда.Выбрать();
				МассивИдентификаторов = Новый Массив;
				МассивИдентификаторовСообщений = Новый Массив;
				Пока ВыборкаОбъектов.Следующий() Цикл
					МассивИдентификаторов.Добавить(ВыборкаОбъектов.Объект.ИдентификаторНаСервере);
					МассивИдентификаторовСообщений.Добавить(ВыборкаОбъектов.Объект.ИдентификаторСообщения);
				КонецЦикла;	
				Если МассивИдентификаторов.Количество()>0 Тогда
					Почта.ПереместитьВПочтовыйЯщик(МассивИдентификаторов, ВыборкаПапокКуда.ТекущаяПапка);
					Почта.ОчиститьУдаленныеСообщения();
					Если МассивИменАктивныхПапок.Найти(ВыборкаПапокКуда.ТекущаяПапка) = Неопределено Тогда Продолжить; КонецЕсли;
					Почта.ТекущийПочтовыйЯщик = ВыборкаПапокКуда.ТекущаяПапка;
					Заголовки = Почта.ПолучитьЗаголовки(Новый Структура("ПослеДатыОтправления, ДоДатыОтправления",
					ВыборкаПапокКуда.ДатаМин-86400, ВыборкаПапокКуда.ДатаМакс+86400));
					ИзмененныеИдентификаторы = Новый Соответствие;
					Для каждого Заголовок Из Заголовки Цикл
						Если МассивИдентификаторовСообщений.Найти(Заголовок.ИдентификаторСообщения) <> Неопределено Тогда
							ИзмененныеИдентификаторы.Вставить(Заголовок.ИдентификаторСообщения, 
							?(Заголовок.Идентификатор.Количество() = 0, "", Заголовок.Идентификатор[0]));
						КонецЕсли;
					КонецЦикла;
					Если ИзмененныеИдентификаторы.Количество()>0 Тогда
						ИзменитьИдентификаторыПисем(ИзмененныеИдентификаторы);
					КонецЕсли;
				КонецЕсли;
				ВыборкаОбъектов.Сбросить();
				Пока ВыборкаОбъектов.Следующий() Цикл
					УдаляемЗапись = РегистрыСведений.CRM_ОтложенныеОперацииПоIMAP.СоздатьМенеджерЗаписи();
					УдаляемЗапись.Объект = ВыборкаОбъектов.Объект;
					УдаляемЗапись.Действие = ВыборкаОбъектов.Действие;
					УдаляемЗапись.УчетнаяЗапись = ДанныеУчетнойЗаписи.Ссылка;
					УдаляемЗапись.Удалить();
				КонецЦикла;	
			КонецЦикла;
		КонецЦикла;
		
		ВыборкаДействий.Сбросить();
		ВыборкаДействий.НайтиСледующий(Новый Структура("Действие", Перечисления.CRM_ДействияПоIMAP.УстановитьФлагПрочтения));
		ВыборкаПапок = ВыборкаДействий.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ТекущаяПапка");
		Пока ВыборкаПапок.Следующий() Цикл
			Если МассивИменАктивныхПапок.Найти(ВыборкаПапок.ТекущаяПапка) = Неопределено Тогда Продолжить; КонецЕсли;
			Почта.ТекущийПочтовыйЯщик = ВыборкаПапок.ТекущаяПапка;
			ВыборкаОбъектов = ВыборкаПапок.Выбрать();
			ФлагиСоответствие = Новый Соответствие;
			Пока ВыборкаОбъектов.Следующий() Цикл
				Если ЗначениеЗаполнено(ВыборкаОбъектов.Объект) Тогда
					Флаги = Новый ФлагиИнтернетПочтовогоСообщения;
					Флаги.Прочитанное = Истина;
					ФлагиСоответствие.Вставить(ВыборкаОбъектов.Объект.ИдентификаторНаСервере, Флаги);
				КонецЕсли;
			КонецЦикла;
			Если ФлагиСоответствие.Количество()>0 Тогда
				Почта.УстановитьФлагиСообщений(ФлагиСоответствие);
			КонецЕсли;
			ВыборкаОбъектов = ВыборкаПапок.Выбрать();
			Пока ВыборкаОбъектов.Следующий() Цикл
				Если ЗначениеЗаполнено(ВыборкаОбъектов.Объект) Тогда
					УдаляемЗапись = РегистрыСведений.CRM_ОтложенныеОперацииПоIMAP.СоздатьМенеджерЗаписи();
					УдаляемЗапись.Объект = ВыборкаОбъектов.Объект;
					УдаляемЗапись.УчетнаяЗапись = ДанныеУчетнойЗаписи.Ссылка;
					УдаляемЗапись.Действие = ВыборкаОбъектов.Действие;
					УдаляемЗапись.Удалить();
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;	
		
		ВыборкаДействий.Сбросить();
		ВыборкаДействий.НайтиСледующий(Новый Структура("Действие", Перечисления.CRM_ДействияПоIMAP.СнятьФлагПрочтения));
		ВыборкаПапок = ВыборкаДействий.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ТекущаяПапка");
		Пока ВыборкаПапок.Следующий() Цикл
			Если МассивИменАктивныхПапок.Найти(ВыборкаПапок.ТекущаяПапка) = Неопределено Тогда Продолжить; КонецЕсли;
			Почта.ТекущийПочтовыйЯщик = ВыборкаПапок.ТекущаяПапка;
			ВыборкаОбъектов = ВыборкаПапок.Выбрать();
			ФлагиСоответствие = Новый Соответствие;
			Пока ВыборкаОбъектов.Следующий() Цикл
				Если ЗначениеЗаполнено(ВыборкаОбъектов.Объект) Тогда
					Флаги = Новый ФлагиИнтернетПочтовогоСообщения;
					Флаги.Прочитанное = Ложь;
					ФлагиСоответствие.Вставить(ВыборкаОбъектов.Объект.ИдентификаторНаСервере, Флаги);
				КонецЕсли;
			КонецЦикла;
			Если ФлагиСоответствие.Количество()>0 Тогда
				Почта.УстановитьФлагиСообщений(ФлагиСоответствие);
			КонецЕсли;
			ВыборкаОбъектов.Сбросить();
			Пока ВыборкаОбъектов.Следующий() Цикл
				Если ЗначениеЗаполнено(ВыборкаОбъектов.Объект) Тогда
					УдаляемЗапись = РегистрыСведений.CRM_ОтложенныеОперацииПоIMAP.СоздатьМенеджерЗаписи();
					УдаляемЗапись.Объект = ВыборкаОбъектов.Объект;
					УдаляемЗапись.УчетнаяЗапись = ДанныеУчетнойЗаписи.Ссылка;
					УдаляемЗапись.Действие = ВыборкаОбъектов.Действие;
					УдаляемЗапись.Удалить();
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
	Исключение
		ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='При синхронизации учетной записи %1 по IMAP, произошла ошибка %2';en='When synchronization account %1 by IMAP, error occurred %2'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			ДанныеУчетнойЗаписи.Ссылка,
			ОписаниеОшибки());
			
		ЗаписьЖурналаРегистрации(УправлениеЭлектроннойПочтой.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Ошибка, , ,
		ТекстСообщенияОбОшибке);
	КонецПопытки;
	
КонецПроцедуры

Процедура ИзменитьИдентификаторыПисем(ИзмененныеИдентификаторы)
	МассивИдентификаторов = Новый Массив;
	Для каждого ИзмененныйИдентификатор Из ИзмененныеИдентификаторы Цикл
		МассивИдентификаторов.Добавить(ИзмененныйИдентификатор.Ключ);
	КонецЦикла;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЭлектронноеПисьмоВходящее.Ссылка КАК Ссылка,
	                      |	ЭлектронноеПисьмоВходящее.ИдентификаторСообщения КАК ИдентификаторСообщения
	                      |ИЗ
	                      |	Документ.ЭлектронноеПисьмоВходящее КАК ЭлектронноеПисьмоВходящее
	                      |ГДЕ
	                      |	ЭлектронноеПисьмоВходящее.ИдентификаторСообщения В(&МассивИдентификаторов)
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ЭлектронноеПисьмоИсходящее.Ссылка,
	                      |	ЭлектронноеПисьмоИсходящее.ИдентификаторСообщения
	                      |ИЗ
	                      |	Документ.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее
	                      |ГДЕ
	                      |	ЭлектронноеПисьмоИсходящее.ИдентификаторСообщения В(&МассивИдентификаторов)");
	Запрос.УстановитьПараметр("МассивИдентификаторов", МассивИдентификаторов);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ИдентификаторНаСервере = ИзмененныеИдентификаторы.Получить(Выборка.ИдентификаторСообщения);
		ПисьмоОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ПисьмоОбъект.ИдентификаторНаСервере = ИдентификаторНаСервере;
		ПисьмоОбъект.ОбменДанными.Загрузка = Истина;
		ПисьмоОбъект.Записать();
	КонецЦикла;
КонецПроцедуры

// Синхронизирует письма в папках по IMAP.
//
// Параметры:
//	ДанныеУчетнойЗаписи - Структура - данные учетной записи.
//	Почта - ИнтернетПочта - почта.
//	ИмяАктивнойПапки - Строка - имя активной папки.
//
Процедура СинхронизироватьПисьмаВПапкахПоIMAP(ДанныеУчетнойЗаписи, Почта, ИмяАктивнойПапки) Экспорт
	
	КвалификаторСтроки200 =  Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(200, ДопустимаяДлина.Переменная));
	ТаблицаИдентификаторов = Новый ТаблицаЗначений;
	ТаблицаИдентификаторов.Колонки.Добавить("ИдентификаторНаСервере", КвалификаторСтроки200);
	ТаблицаИдентификаторов.Колонки.Добавить("ИдентификаторПисьма", КвалификаторСтроки200);
	ТаблицаИдентификаторов.Колонки.Добавить("Прочитанное", Новый ОписаниеТипов("Булево"));
	
	ПараметрыОтбора = Новый Структура;
	
	Попытка
		Если Почта.ПолучитьКоличествоСообщений() > 1000 Тогда
			ПараметрыОтбора.Вставить("ПослеДатыОтправления",ДанныеУчетнойЗаписи.ДатаЗагрузкиПисем - 2592000);
		КонецЕсли;
		
		МассивИдентификаторовДляЗагрузки = Новый Массив; 
		
		ЗаголовкиПисемДляЗагрузки = Почта.ПолучитьЗаголовки(ПараметрыОтбора);

		ТаблицаИдентификаторов.Очистить();
		МассивИдентификаторов = Новый Массив;
		Для Каждого ЗаголовокПисьма Из ЗаголовкиПисемДляЗагрузки Цикл
			
			Если ПустаяСтрока(ЗаголовокПисьма.ИдентификаторСообщения) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЗаголовокПисьма.Идентификатор.Количество() > 0 Тогда
				МассивИдентификаторов.Добавить(ЗаголовокПисьма.Идентификатор[0]);
			КонецЕсли;
			
		КонецЦикла;
		Если МассивИдентификаторов.Количество()>0 Тогда
			ФлагиСообщений = Почта.ПолучитьФлагиСообщений(МассивИдентификаторов);
		КонецЕсли;
		
		Для Каждого ЗаголовокПисьма Из ЗаголовкиПисемДляЗагрузки Цикл
			
			Если ПустаяСтрока(ЗаголовокПисьма.ИдентификаторСообщения) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрокаТаблицыИдентификаторов = ТаблицаИдентификаторов.Добавить();
			НоваяСтрокаТаблицыИдентификаторов.ИдентификаторНаСервере = ?(ЗаголовокПисьма.Идентификатор.Количество() = 0, "", ЗаголовокПисьма.Идентификатор[0]);
			НоваяСтрокаТаблицыИдентификаторов.ИдентификаторПисьма    = ЗаголовокПисьма.ИдентификаторСообщения;
			ФлагиСообщения = ФлагиСообщений.Получить(НоваяСтрокаТаблицыИдентификаторов.ИдентификаторНаСервере);
			Если ФлагиСообщения <> Неопределено Тогда
				НоваяСтрокаТаблицыИдентификаторов.Прочитанное    = ФлагиСообщения.Прочитанное;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТаблицаИдентификаторов.Количество()=0 Тогда
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ИдентификаторыПисемКЗагрузке.ИдентификаторПисьма КАК ИдентификаторПисьма,
		|	ИдентификаторыПисемКЗагрузке.ИдентификаторНаСервере КАК ИдентификаторНаСервере,
		|	ИдентификаторыПисемКЗагрузке.Прочитанное КАК ПрочитанноеНаСервере
		|ПОМЕСТИТЬ ИдентификаторыПисемКЗагрузке
		|ИЗ
		|	&ИдентификаторыПисемКЗагрузке КАК ИдентификаторыПисемКЗагрузке
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИдентификаторыПисемКЗагрузке.ИдентификаторПисьма КАК ИдентификаторПисьма,
		|	ИдентификаторыПисемКЗагрузке.ИдентификаторНаСервере КАК ИдентификаторНаСервере,
		|	ИдентификаторыПисемКЗагрузке.ПрочитанноеНаСервере КАК ПрочитанноеНаСервере,
		|	ЕСТЬNULL(ЭлектронноеПисьмоВходящее.Ссылка, ЭлектронноеПисьмоИсходящее.Ссылка) КАК Письмо,
		|	ИдентификаторыПисемКЗагрузке.ПрочитанноеНаСервере <> (НепрочитанныеЭлектронныеПисьма.Письмо ЕСТЬ NULL) КАК ПрочтениеИзменено
		|ИЗ
		|	ИдентификаторыПисемКЗагрузке КАК ИдентификаторыПисемКЗагрузке
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭлектронноеПисьмоВходящее КАК ЭлектронноеПисьмоВходящее
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_НепрочитанныеЭлектронныеПисьма КАК НепрочитанныеЭлектронныеПисьма
		|			ПО ЭлектронноеПисьмоВходящее.Ссылка = НепрочитанныеЭлектронныеПисьма.Письмо
		|		ПО ИдентификаторыПисемКЗагрузке.ИдентификаторПисьма = ЭлектронноеПисьмоВходящее.ИдентификаторСообщения
		|			И (ЭлектронноеПисьмоВходящее.УчетнаяЗапись = &УчетнаяЗапись)
		|			И (ИдентификаторыПисемКЗагрузке.ИдентификаторНаСервере <> ЭлектронноеПисьмоВходящее.ИдентификаторНаСервере
		|				ИЛИ ИдентификаторыПисемКЗагрузке.ПрочитанноеНаСервере <> (НепрочитанныеЭлектронныеПисьма.Письмо ЕСТЬ NULL))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее
		|		ПО (ЭлектронноеПисьмоИсходящее.УчетнаяЗапись = &УчетнаяЗапись)
		|			И (ИдентификаторыПисемКЗагрузке.ИдентификаторПисьма = ЭлектронноеПисьмоИсходящее.ИдентификаторСообщения
		|				ИЛИ ИдентификаторыПисемКЗагрузке.ИдентификаторПисьма = ЭлектронноеПисьмоИсходящее.ИдентификаторСообщенияОтправкаIMAP)
		|			И (ИдентификаторыПисемКЗагрузке.ИдентификаторНаСервере <> ЭлектронноеПисьмоВходящее.ИдентификаторНаСервере)
		|ГДЕ
		|	(НЕ ЭлектронноеПисьмоВходящее.Ссылка ЕСТЬ NULL
		|			ИЛИ НЕ ЭлектронноеПисьмоИсходящее.Ссылка ЕСТЬ NULL)";
		
		Запрос.УстановитьПараметр("ИдентификаторыПисемКЗагрузке", ТаблицаИдентификаторов);
		Запрос.УстановитьПараметр("УчетнаяЗапись", ДанныеУчетнойЗаписи.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Количество()>0 Тогда
			Папка = CRM_УправлениеЭлектроннойПочтой.ПолучитьПапкуЭлектронногоПисьма(ДанныеУчетнойЗаписи.Ссылка, Неопределено, ИмяАктивнойПапки);
			
			Пока Выборка.Следующий() Цикл
				Попытка
					НачатьТранзакцию();
					Если Выборка.Письмо.ИдентификаторНаСервере <> Выборка.ИдентификаторНаСервере Тогда
						ПисьмоОбъект = Выборка.Письмо.ПолучитьОбъект();
						ПисьмоОбъект.ИдентификаторНаСервере = Выборка.ИдентификаторНаСервере;
						ПисьмоОбъект.ОбменДанными.Загрузка = Истина;
						ПисьмоОбъект.Записать();
						Если Папка.CRM_Вид = Перечисления.CRM_ВидыПапокЭлектроннойПочты.Удаленные
							И НЕ ПисьмоОбъект.ПометкаУдаления Тогда
							ПисьмоОбъект.УстановитьПометкуУдаления(Истина);
						КонецЕсли;
						
						СтруктураДляЗаписи = РегистрыСведений.ПредметыПапкиВзаимодействий.РеквизитыВзаимодействия();
						СтруктураДляЗаписи.Папка                   = Папка;
						СтруктураДляЗаписи.РассчитыватьРассмотрено = Ложь;
						
						НаборЗаписей = РегистрыСведений.ПредметыПапкиВзаимодействий.СоздатьНаборЗаписей();
						НаборЗаписей.Отбор.Взаимодействие.Установить(Выборка.Письмо);
						НаборЗаписей.ОбменДанными.Загрузка = Истина;
						РегистрыСведений.ПредметыПапкиВзаимодействий.ЗаписатьПредметыПапкиВзаимодействий(Выборка.Письмо, СтруктураДляЗаписи, НаборЗаписей);
						НаборЗаписей.Записать();
					КонецЕсли;
					Если Выборка.ПрочтениеИзменено Тогда
						МассивПрочтенных = Новый Массив;
						МассивПрочтенных.Добавить(Выборка.Письмо);
						CRM_УправлениеЭлектроннойПочтой.УстановитьСнятьПометкуОПрочтении(МассивПрочтенных, Выборка.ПрочитанноеНаСервере);
					КонецЕсли;
					
					ЗафиксироватьТранзакцию();
				Исключение
					ОтменитьТранзакцию();
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
	Исключение
		ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='При синхронизации учетной записи %1 по IMAP, произошла ошибка %2';en='When synchronization account %1 by IMAP, error occurred %2'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
		ДанныеУчетнойЗаписи.Ссылка,
		ОписаниеОшибки());
		
		ЗаписьЖурналаРегистрации(УправлениеЭлектроннойПочтой.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Ошибка, , ,
		ТекстСообщенияОбОшибке);
	КонецПопытки;
	
КонецПроцедуры

Процедура ПереместитьВсеПисьмаВПапкуНаСервере(Почта, Папка)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЭлектронноеПисьмоВходящее.Ссылка КАК Ссылка,
	                      |	ЭлектронноеПисьмоВходящее.ИдентификаторНаСервере КАК ИдентификаторНаСервере
	                      |ПОМЕСТИТЬ Письма
	                      |ИЗ
	                      |	Документ.ЭлектронноеПисьмоВходящее КАК ЭлектронноеПисьмоВходящее
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ЭлектронноеПисьмоИсходящее.Ссылка,
	                      |	ЭлектронноеПисьмоИсходящее.ИдентификаторСообщенияОтправкаIMAP
	                      |ИЗ
	                      |	Документ.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Письма.ИдентификаторНаСервере КАК ИдентификаторНаСервере
	                      |ИЗ
	                      |	Письма КАК Письма
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПредметыПапкиВзаимодействий КАК ПредметыПапкиВзаимодействий
	                      |		ПО Письма.Ссылка = ПредметыПапкиВзаимодействий.Взаимодействие
	                      |			И (ПредметыПапкиВзаимодействий.ПапкаЭлектронногоПисьма = &Папка)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |УНИЧТОЖИТЬ Письма");
	
	Запрос.УстановитьПараметр("Папка", Папка);
	МассивИдентификаторов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИдентификаторНаСервере");
	Почта.ПереместитьВПочтовыйЯщик(МассивИдентификаторов, Папка.CRM_ИмяНаСервере);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
